{
  "rating": null,
  "total": 67,
  "reviews": [
    {
      "author_name": "Anna Rose",
      "rating": 5,
      "relative_time_description": "7 months ago on Google",
      "text": "Everything was good, the apartment is located just near the port, in a new modern building with the lift. For me it was a big luck because I had 2 heavy baggages. Very friendly and professional client support. I had some problem during my stay and they fixed this fast. Thank you! I would be glad to come back next time!"
    },
    {
      "author_name": "Mels Dilettantdesign",
      "rating": 5,
      "relative_time_description": "4 months ago on Google",
      "text": "Shruti, our host, always answered within a few minutes. We liked the accommodation immediately."
    },
    {
      "author_name": "Carmen Duse",
      "rating": 5,
      "relative_time_description": "a year ago on Google",
      "text": "Perfect choice for Antwerp. Gaurav was very helpful and responded immediately to all requests. Easy to reach all parts of the city. Central and yet quiet, with all the conditions ensured. There are plenty of bars and restaurants in the neighborhood. I highly recommend."
    },
    {
      "author_name": "Andres Montoya",
      "rating": 5,
      "relative_time_description": "2 years ago on Google",
      "text": "This is an amazing apartment with everything you need, incredibly clean and comfortable. Arrival is easy and access even more so. Gaurav was always available to help us with everything we needed. I will definitely be back soon."
    },
    {
      "author_name": "Tim Polk",
      "rating": 5,
      "relative_time_description": "2 years ago on Google",
      "text": "Very nice and clean apartment in the heart of the Eilandje area of Antwerp. The interior is trendy and you get a nice side view of the docks. Shops, restaurants and public transport as well as sharing services are all within easy reach. Gaurav of CS was very helpful in resolving an issue we had with the key."
    },
    {
      "author_name": "Nélio Mendonça",
      "rating": 3,
      "relative_time_description": "2 years ago on Google",
      "text": "+The place was clean and smelling good. Everything was working well, there's even a Netflix account. Location is good. - Isolation, we could hear people walking and water running from the above floor. The 3rd bed wasnt ready. The owner pushing us to make a review. The cleaning lady opened our door at 10h40 without knocking when the check-out was at 11. We would stay again for 1 or 2 nights."
    },
    {
      "author_name": "peri ravitz",
      "rating": 5,
      "relative_time_description": "2 years ago on Google",
      "text": "We enjoyed very much our stay in the apartment in Antwerp city. The apartment is very clean and nice. For every question or help we needed we were in contact with Mrs. Kalyani. She was very helpful and kind. We will be happy to come back when we will visit Antwerp the next time."
    },
    {
      "author_name": "J Maddocks",
      "rating": 5,
      "relative_time_description": "3 years ago on Google",
      "text": "Our stay was very nice, the apartment is in a good location, has a cosy feel, close to the tram and many other restaurants nearby. We needed a few items and Gaurav was quick to help us out with what we needed. Great customer service. I can highly recommend."
    },
    {
      "author_name": "Dan-Maniu Duse",
      "rating": 5,
      "relative_time_description": "Edited a year ago on Google",
      "text": "Perfect choice for Antwerp. Gaurav was very helpful and responded immediately to all requests. Easy to reach all parts of the city. Central and yet quiet, with all the conditions ensured. I highly recommend this place."
    },
    {
      "author_name": "Dmitri Stekatchev",
      "rating": 2,
      "relative_time_description": "3 years ago on Google",
      "text": "My impressions of the stay - not the most pleasant. It all started with a message from the owner of the apartment the evening before I left that I should contact some of his employees to find out if the apartment would be ready for my arrival. As if I no longer have my own affairs, I must control the readiness of my future home. This is despite the fact that I indicated in advance the planned time of my arrival and sent a passport photo, at the request of the owner. Nevertheless, contact was made and I settled in. The apartment is very cozy and pleasant, the furniture is not new, but in good condition, the bed and pillows are comfortable, there are dishes, a stove, a kettle and other items for cooking. But it looks like the apartment is very poorly maintained. Upon my arrival, the floor was dirty, spoiled food remained in the refrigerator, frozen women's hair in the freezer. Some dishes were not washed, there were incomprehensible greasy stains on the nightstands in the bedroom, burnt candles and caps from beer bottles lay in places on the floor. At the same time, the apartment does not even have cleaning devices, only a broom and a scoop. There is also no microwave, which is very inconvenient. I'm not even talking about pleasant little things like shampoo in the shower and salt and pepper in the kitchen. Although there was shampoo, it looks like it was left from previous tenants (it was in disposable jars, like from a hotel and not complete). In addition to all the shortcomings, the owner also sent me a message asking me to rate it 5 stars and send him a screenshot with a report. It's the first time I've seen such audacity. As if I was his subordinate, and I have to report. I'm giving 2 stars instead of 1 because the apartment is still quite comfortable. But, if I knew in advance, I would never have settled there."
    },
    {
      "author_name": "Tugba Khan",
      "rating": 5,
      "relative_time_description": "a year ago on Google",
      "text": "The rooms were clean and Gustav was really helpful. If we needed anything we could message and got help immediately. Check in was easy. I recommend."
    },
    {
      "author_name": "Adelfo Carvalho Martins Junior",
      "rating": 5,
      "relative_time_description": "3 years ago on Google",
      "text": "Great. Very good. Clean. All necessary accessories. Educated people. All clean. All perfect. Everything organized. I am really happy. I liked. I will return again to OneLuxury. I recommend. Couples when coming to Antwerp this is a great place to stay! Thank you very much! Really satisfied. I want to praise. No complaints. Thanks."
    },
    {
      "author_name": "Pawel Poniatowski",
      "rating": 5,
      "relative_time_description": "2 years ago on Google",
      "text": "Very nice, huge and clean appartement. Close to the city center. I recommend everyone who want spend time in Antwerpen. The owner is Gauravr - he help me check in despite it was late. What is also important the price was the lowest in this area."
    },
    {
      "author_name": "mirsida xhuferaj",
      "rating": 5,
      "relative_time_description": "2 years ago on Google",
      "text": "It was a really comfortable apartment, very clean and near the center. Thanks to Gaurav who helped as we had a really nice stay in Antwerp."
    },
    {
      "author_name": "Caroline Kourentzis",
      "rating": 5,
      "relative_time_description": "Edited 3 years ago on Google",
      "text": "Fabulous stay in this lovely apartment. Everything was spot on. To add to this, I accidentally left clothing in the apartment which I desperately wanted back with me in England. They were so accommodating. When a colleague of theirs visited England they brought them over and posted them to me at no cost. What an amazing gesture."
    },
    {
      "author_name": "Jubitana's Entertainment",
      "rating": 5,
      "relative_time_description": "3 years ago on Google",
      "text": "It was a great stay and is a nice place in Antwerp. I can recommend it. It is very cosy modern and you can feel the vibe of the city. The host is very helpful. Thanks to Gaurav for helping me with check in and guides for the place. The accommodation is clean and it has everything you need."
    },
    {
      "author_name": "Anna Fedorets",
      "rating": 5,
      "relative_time_description": "2 years ago on Google",
      "text": "I really liked everything. The location is perfect, the apartment is great, everything is there, everything works, it's clean. Gaurav helped with check-in, was kind. I recommend."
    },
    {
      "author_name": "Tatiana Avendaño",
      "rating": 5,
      "relative_time_description": "3 years ago on Google",
      "text": "The place has everything for you, it is perfect for a couple because the place is small. It has amazing location, it is closer to the museums and touristic things. Thanks for Garauv and Mohamend they gave us amazing service and attention. They were attentive to help us with any need, doubt or concern. Thanks for everything."
    },
    {
      "author_name": "Marin vd Boogaerd",
      "rating": 5,
      "relative_time_description": "3 years ago on Google",
      "text": "We had a wonderful stay here. Location is perfect and the apartment has everything you need. Gaurav was really helpful and replies quick if you have any questions."
    },
    {
      "author_name": "Jeremy Eckelton",
      "rating": 5,
      "relative_time_description": "2 years ago on Google",
      "text": "Awesome place to stay. We've stayed here for 2 days, and it's close to everything. Will definitely stay here again and recommend for anyone that wants to stay over in Antwerp."
    },
    {
      "author_name": "Y S",
      "rating": 5,
      "relative_time_description": "2 years ago on Google",
      "text": "I really liked it here, the apartments are tastefully done, there is everything you need for a comfortable stay, I want to thank the manager Kalyani, his concern for guests is something incredible."
    },
    {
      "author_name": "Timothy Ainge",
      "rating": 5,
      "relative_time_description": "2 years ago on Google",
      "text": "Great location right next to Napoleon's Quay, modern furnishings, comfortable layout, and excellent service from the hosts. I wouldn't hesitate to stay here again the next time in Antwerp."
    },
    {
      "author_name": "A A",
      "rating": 5,
      "relative_time_description": "2 years ago on Google",
      "text": "My stay with the host Gaurav is always excellent. The maintenance of all his apartments are excellent and very nice. All the apartments I have been in with this host were excellent, always clean and fresh, no complaints whatsoever. Highly recommended to choose the host Gaurav and Nishita. They always can offer you the best apartments and a very warm welcome. I'm very happy with them and I can't recommend better than this dream team."
    },
    {
      "author_name": "John Temple",
      "rating": 5,
      "relative_time_description": "2 years ago on Google",
      "text": "Gaurav was a great host, and the stay was wonderful. If you're visiting Antwerp this is the best deal and place you can find."
    },
    {
      "author_name": "Daniel M",
      "rating": 4,
      "relative_time_description": "2 years ago on Google",
      "text": "We liked the apartment. It wasn’t noisy and clean. It was near the MAS museum and it was near some good restaurants to make good breakfast experiences."
    },
    {
      "author_name": "Lea Schöttner",
      "rating": 5,
      "relative_time_description": "3 years ago on Google",
      "text": "Nice, clean apartment. We really enjoyed our stay there. The service by Gaurav was good, too."
    },
    {
      "author_name": "Liliya Tsvetkova",
      "rating": 5,
      "relative_time_description": "2 years ago on Google",
      "text": "Perfect place to stay in Antwerp. The apartment is very clean, modern, cozy and comfortable."
    },
    {
      "author_name": "Zahra Rahmdel",
      "rating": 5,
      "relative_time_description": "a year ago on Google",
      "text": "You feel like you are at home with all required kitchen utensils. You will quite easily have access to tram and bus for commuting."
    },
    {
      "author_name": "ELISA SCORZA",
      "rating": 5,
      "relative_time_description": "2 years ago on Google",
      "text": "Had a perfect stay in the apartment which was super clean and suitable for a three persons’ stay. Very good position also."
    },
    {
      "author_name": "Frans Vh",
      "rating": 5,
      "relative_time_description": "2 years ago on Google",
      "text": "The apartment has all you need and a good size. The area is very nice with a lot of water."
    },
    {
      "author_name": "Javad Adlparvar",
      "rating": 5,
      "relative_time_description": "a year ago on Google",
      "text": "Nice place in interesting location, the host was awesome and friendly, Gaurav responded fast and efficient, awesome experience at all."
    },
    {
      "author_name": "Nesti",
      "rating": 5,
      "relative_time_description": "2 years ago on Google",
      "text": "Apartment looks same beautiful like in pictures, clean, good location and staff can help u quickly with anything u need."
    },
    {
      "author_name": "שירה זגורי",
      "rating": 5,
      "relative_time_description": "2 years ago on Google",
      "text": "The house is clean, new, pleasant, kind hosts will give a quick response. Grove is a great guy, they deserve more than 5 stars."
    },
    {
      "author_name": "Nikita Markov",
      "rating": 5,
      "relative_time_description": "3 years ago on Google",
      "text": "Gaurav is a nice and friendly host. Everything was great, no complaints. Will come back again."
    },
    {
      "author_name": "Francesco Guazzini",
      "rating": 5,
      "relative_time_description": "2 years ago on Google",
      "text": "Apartment very good in very good location nearby all restaurant and very close to the center. Gaurav very helpful and quick response."
    },
    {
      "author_name": "John Wick",
      "rating": 5,
      "relative_time_description": "2 years ago on Google",
      "text": "Lovely and clean apartment, great location. Gaurav was great help to me, would recommend them."
    },
    {
      "author_name": "Marjon Beekhof",
      "rating": 5,
      "relative_time_description": "Edited 3 years ago on Google",
      "text": "Good location. Good apartment and the kitchen is super. We had nice days there."
    },
    {
      "author_name": "theo masson",
      "rating": 5,
      "relative_time_description": "2 years ago on Google",
      "text": "Perfect stay, the apartment is very well located and the owner is very responsive."
    },
    {
      "author_name": "Andy Stone",
      "rating": 5,
      "relative_time_description": "2 years ago on Google",
      "text": "Very comfortable, near to center. And very clean. Thanks Gaurav for all help."
    },
    {
      "author_name": "Wojtek Sikorzewski",
      "rating": 5,
      "relative_time_description": "2 years ago on Google",
      "text": "Great place, very clean and perfectly located. Responsive host."
    },
    {
      "author_name": "Ebrar Baltaci",
      "rating": 5,
      "relative_time_description": "2 years ago on Google",
      "text": "Everything was nice. Thanks for helping dear Guaurav."
    },
    {
      "author_name": "Olivier Longville",
      "rating": 5,
      "relative_time_description": "2 years ago on Google",
      "text": "Nice place, clean and convenient. Good location."
    },
    {
      "author_name": "mauricio amorin",
      "rating": 5,
      "relative_time_description": "3 years ago on Google",
      "text": "Good experience, everything is clean and good location."
    },
    {
      "author_name": "mohammed erraji",
      "rating": 5,
      "relative_time_description": "2 years ago on Google",
      "text": "Pretty apparently, well located, well furnished."
    },
    {
      "author_name": "Vytautė Milerytė",
      "rating": 5,
      "relative_time_description": "3 years ago on Google",
      "text": "Gaurav very helped for me, thank you."
    },
    {
      "author_name": "Kelly Pacheco",
      "rating": 5,
      "relative_time_description": "2 years ago on Google",
      "text": "Very nice place."
    },
    {
      "author_name": "amanda vollenweider",
      "rating": 5,
      "relative_time_description": "3 years ago on Google",
      "text": "Nice place to stay."
    },
    {
      "author_name": "Ss Jodha",
      "rating": 5,
      "relative_time_description": "a year ago on Google",
      "text": "It's nice riverside. Very close to public transport."
    },
    {
      "author_name": "Mathias Gerbaud",
      "rating": 1,
      "relative_time_description": "2 months ago on Google",
      "text": "Réservation annulée par le propriétaire moins de 24h avant mon arrivée sans aucune explication. Et 1 mois plus tard j'attends toujours le remboursement de mon paiement."
    },
    {
      "author_name": "420gerardz",
      "rating": 1,
      "relative_time_description": "8 months ago on Tripadvisor",
      "text": "Verschrikkelijk! Niet boeken! Geboekt via Booking.com, bij aankomst konden we de kamer niet in en de telefoon werd niet opgenomen. Pas in de namiddag was er contact en ik kreeg het voorstel om €150,- cash te betalen om toegelaten te worden in de ruimte. Uiteraard was alles, inclusief \"city tax\" al betaald aan Booking.com bij reservering. Ook via Booking.com (moeilijk tel bereikbaar) kwam er geen oplossing. Pas in de vooravond, toen we al onderweg naar huis waren ontvingen we het kamernummer en de toegangscode. Alles verprutst door deze gang van zaken. Ik ben onder druk gezet om extra cash te betalen (\"you have half an hour to decide\"). Mijn advies: deze accomodatie niet reserveren, ook aan Booking.com heb je niets als je niet wordt toegelaten in het appartement!"
    },
    {
      "author_name": "Yasmine Timimoun",
      "rating": 5,
      "relative_time_description": "5 months ago on Google",
      "text": "Appart-hotel très mignon et plein de charme. Très bien situé, il se trouve non loin du centre ville."
    },
    {
      "author_name": "Tiziana",
      "rating": 5,
      "relative_time_description": "2 years ago on Google",
      "text": "Bellissimo appartamento a due passi dal centro, presso il vecchio porto di Anversa, dove si possono trovare molti locali per cenare. Nelle immediate vicinanze anche un grande supermercato. L'appartamento è ben strutturato: la camera da letto si affaccia su un cortile interno ed è silenziosa. L'angolo cottura è ben attrezzato e dotato anche di lavatrice e la zona pranzo è molto spaziosa e luminosa. Consigliato anche per soggiorni lunghi."
    },
    {
      "author_name": "Nynke Faber",
      "rating": 5,
      "relative_time_description": "2 years ago on Google",
      "text": "Wij verbleven hier met drie personen. Heel fijn appartement, gezellig ook. Vrij nieuw nog alles, goed verzorgd, schoon, alles was aanwezig. Enige minpuntjes die ik kan bedenken waren de scheve wc bril (beetje irritant) en de waterkoker zonder stopbeveiliging (bleef doorkoken als je hem zelf niet uitdeed want er miste een klepje). Plus wasrek heb ik niet gezien (ook niet nodig gehad trouwens). Fijne slaapkamer aan stille kant van het appartement en prima slaapbank in woonkamer. Verder goede locatie in mooi deel van Antwerpen vlakbij het MAS Museum en nabij jachthaven (Willemdok). Lopen naar bv Grote Markt is prima te doen in ca 20 minuten, en ook naar CS lopen is goed te doen (ca 25 minuten). En anders is de tramhalte praktisch voor de deur. Al met al prima verblijf en zou hier zeker terugkomen als ik nog eens Antwerpen zou bezoeken."
    },
    {
      "author_name": "fausto pasquinelli",
      "rating": 5,
      "relative_time_description": "3 years ago on Google",
      "text": "Appartamento situato in una zona prestigiosa di Anversa, ben servito con il centro ma raggiungibile anche a piedi. Il Sig Gaurav ha inviato le istruzioni per il check in ed è stato molto disponibile per qualsiasi aiuto. All’interno abbiamo trovato tutto il necessario per poter anche viverci, dalle pentole, bicchieri, piatti posate, frigo, forno e lavatrice oltre ad altri vari accessori quali asse da stiro, ferro da stiro e stendino. La pulizia merita un 10, mobili nuovi, bagno impeccabile. La tv super accessoriata con Netflix, Amazon Prime etc. Altro dettaglio da non trascurare silenzioso pur essendo vicino a importanti vie di comunicazione. Per noi il punteggio è il max 10."
    },
    {
      "author_name": "Susanne Haug",
      "rating": 5,
      "relative_time_description": "2 years ago on Google",
      "text": "Die Unterkunft ist sehr schön und sauber. Alles, was man braucht ist vorhanden. Außerdem liegt sie sehr zentral. Straßenbahn und S-Bahn fußläufig. Man kann aber auch zu Fuß, ca. 20 min, in die Altstadt laufen. Antwerpen ist unbedingt eine Reise wert!"
    },
    {
      "author_name": "Sandra Vandenbussche",
      "rating": 5,
      "relative_time_description": "3 years ago on Google",
      "text": "Ideaal appartementje voor koppel, alles proper, goed en ruim bed, comfortabel, ideaal gelegen bij openbaar vervoer. Iets vergeten op appartement en Gaurav liet me al weten dat het gevonden is en het me zal bezorgd worden. Dank je wel voor de service!"
    },
    {
      "author_name": "soumaya gadri",
      "rating": 5,
      "relative_time_description": "3 years ago on Google",
      "text": "Très joli appartement, spacieux, propre, il y a dedans tout ce qu'il faut, Gaurav le gérant était à l'écoute, toujours réactif aux messages pour répondre à toutes mes questions. Je recommande."
    },
    {
      "author_name": "Elise Verbaan",
      "rating": 5,
      "relative_time_description": "3 years ago on Google",
      "text": "Het appartement is super. De kamers zijn ruim, de bedden zijn goed. Service is zeer goed. Wij zijn zeer vriendelijk geholpen door Gaurav. Zeker voor herhaling vatbaar."
    },
    {
      "author_name": "Alicia",
      "rating": 5,
      "relative_time_description": "3 years ago on Google",
      "text": "Schönes Apartment, sehr sauber und ordentlich eingerichtet. Sehr zentral und nah an der Innenstadt. Wir haben uns hier sehr wohl gefühlt und kommen gerne wieder."
    },
    {
      "author_name": "Evi Taxiarchopoulou",
      "rating": 5,
      "relative_time_description": "3 years ago on Google",
      "text": "Wenn ich Antwerpen wieder besuche, werde ich in diesem Zimmer übernachten. Ich habe es geliebt. Alles, was ich zu sagen habe, ist ein großes Dankeschön Oneluxstay. Gaurav war sehr nett und hilfsbereit. Danke für alles."
    },
    {
      "author_name": "Wilson Araya-Pérez",
      "rating": 5,
      "relative_time_description": "3 years ago on Google",
      "text": "Lindo departamento. Limpio, bien ubicado y tranquilo. Fuimos bien recibidos y Garauv estuvo atento a nuestras consultas y a ayudarnos en todo momento. Lo recomiendo."
    },
    {
      "author_name": "wim kersten",
      "rating": 5,
      "relative_time_description": "3 years ago on Google",
      "text": "Goede en nette appartement alles aanwezig goede communicatie voor sleutel en aankomst. Dicht bij centrum, parkeren oke, Gaurav app vooraankondiging en vertrek top. Volgende keer weer. Aanrader."
    },
    {
      "author_name": "Kyan Oosterhuis",
      "rating": 5,
      "relative_time_description": "2 years ago on Google",
      "text": "Het verblijf was goed geregeld en was precies wat we verwacht hadden. Zeker een aanrader voor als je een keer wilt overnachten in Antwerpen."
    },
    {
      "author_name": "Eric DANIEL",
      "rating": 5,
      "relative_time_description": "3 years ago on Google",
      "text": "Très bonne emplacement. Appartement plutôt calme. Facile à se garer aux alentours. Et proximité des lieux touristiques."
    },
    {
      "author_name": "Holger Oehrlich",
      "rating": 5,
      "relative_time_description": "3 years ago on Google",
      "text": "Tolle Location, viele Restaurants, Museen, alles fussläufig erreichbar, danke Gaurav für deinen Support!"
    },
    {
      "author_name": "Cindy Thomassen",
      "rating": 5,
      "relative_time_description": "2 years ago on Google",
      "text": "Mooi en net appartement dicht bij het centrum. Goed geholpen door Gaurav."
    },
    {
      "author_name": "Dnl Rbl",
      "rating": 5,
      "relative_time_description": "2 years ago on Google",
      "text": "Perfekt. Gaurav hat uns bestens versorgt und alles war sehr gut!"
    },
    {
      "author_name": "Raphaela Fernandes",
      "rating": 5,
      "relative_time_description": "2 years ago on Google",
      "text": "Amei. Uma vista maravilhosa, super indico, anfitrião super legal. Amei minha experiência."
    },
    {
      "author_name": "A M",
      "rating": 5,
      "relative_time_description": "3 years ago on Google",
      "text": "Super expérience tres belle appartement super bien placé."
    },
    {
      "author_name": "Grzegorz Sobolewski",
      "rating": 5,
      "relative_time_description": "a year ago on Google",
      "text": "Luxury."
    },
    {
      "author_name": "Alana Gomes",
      "rating": 5,
      "relative_time_description": "a year ago on Google",
      "text": "Luxury, Great view, Romantic, Quiet, Kid-friendly, Great value, High-tech."
    },
    {
      "author_name": "Hilal T",
      "rating": 5,
      "relative_time_description": "3 years ago on Google",
      "text": ""
    },
    {
      "author_name": "Johan Driessens",
      "rating": 5,
      "relative_time_description": "3 years ago on Google",
      "text": ""
    },
    {
      "author_name": "Hava Akhmadova",
      "rating": 5,
      "relative_time_description": "3 years ago on Google",
      "text": ""
    },
    {
      "author_name": "James Camba",
      "rating": 5,
      "relative_time_description": "3 years ago on Google",
      "text": ""
    },
    {
      "author_name": "Mari Montilla",
      "rating": 5,
      "relative_time_description": "3 years ago on Google",
      "text": ""
    },
    {
      "author_name": "Михаил М",
      "rating": 5,
      "relative_time_description": "3 years ago on Google",
      "text": "Magnifique."
    },
    {
      "author_name": "Татьяна Токарева",
      "rating": 5,
      "relative_time_description": "2 years ago on Google",
      "text": ""
    },
    {
      "author_name": "Moulay Alaoui",
      "rating": 5,
      "relative_time_description": "3 years ago on Google",
      "text": ""
    }
  ]
}
