{
  "rating": 5,
  "total": 23,
  "reviews": [
    {
      "author_name": "Lubica",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "We have stayed in this apartment over 2 months. We had a fabulous stay feeling completely like at home. Special thanks to Shruti for amazing proactive approach and always communicating on all occasions. We couldn't thank her enough for all efforts she tried to help us with during our stay to feel at our most comfortable. Shall we return back I will source her services and of course stay at these almost like home apartments. Thanks Shruti and see you soon."
    },
    {
      "author_name": "Beth Loubavitch Etudiants",
      "rating": 5,
      "relative_time_description": "Edited 6 months ago",
      "text": "We had a wonderful stay - everything was perfect from start to finish. The place was clean, comfortable, and exactly as described. The team was responsive and helpful throughout our stay. A special thank you to Shruti, who went above and beyond to make sure we had everything we needed. Her kindness and attention to detail truly made a difference. Highly recommended!"
    },
    {
      "author_name": "Surbhi Narain",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "Comfortable stay. Well located (2 min walk to National Bank Station, 5 mins walk to Stadts park, 10 mins walk to grocery store). Thoughtfully furnished 3-bedroom apartment with all kitchen necessities. Prompt service on all accounts by property manager (Shruti). Suggestions: It would be good to leave a list of basic instructions (nearest grocery store, garbage disposal etc) for the occupant. Overall a very good experience in Antwerp."
    },
    {
      "author_name": "Kim Nguyen",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "Very clean apartment. We were there with three people and felt really comfortable. From the price-performance ratio unbeatable. Also our contact person Gaurav was always available and took care of us. Many thanks!"
    },
    {
      "author_name": "Alien Inc.",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "For this price is one of the best places to stay in Antwerp. Gaurav, the host was very helpful and super fast, everything done via WhatsApp. Checking in took not more than 1 minute. Everything is brand new, the big sleeping room has its own bathroom, everything was extremely clean, sleeping experience is perfect, there was not any noise from outside even if it's quite a central location. Will come back for sure."
    },
    {
      "author_name": "Marek Sopko",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "Excellent, communication with the owner was without any problems via WhatsApp. We arrived according to the instructions, we picked up the keys from the keybox, the apartment was huge, clean, beds up to 6 people, two toilets, nice clean bathroom, TV, wifi, kitchen, Nespresso machine available even with the coffee capsules, balcony (terrace), the apartment was warm (can adjust temperature), it's about 20 min walking to the city center. Cons: a little noise from the street but the street is not as busy as elsewhere in the city, no parking - we left the car at the P+R parking lot. I recommend it!"
    },
    {
      "author_name": "Limburg De Voorzorg",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "Great service and hygiene. Beautiful rooms."
    },
    {
      "author_name": "Tomazter",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "For the price this is the nicest place to stay. Definitely recommended, nicely decorated, smells good and is close to the city center."
    },
    {
      "author_name": "Amin K",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "We had a great experience, nice and super clean apartment and a perfect location in Antwerp."
    },
    {
      "author_name": "Dimitris Petropoulos",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "Really nice and clean place, totally worth it. Thanks to Gaurav for the help and advice during our whole stay. Definitely recommended."
    },
    {
      "author_name": "Deepak Van den Poel",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Gaurav, it was a perfect stay and very quiet. Everything was there what you need."
    },
    {
      "author_name": "Milk Man",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "Good place to stay when you're in Antwerpen. Close by everything."
    },
    {
      "author_name": "badr sekiati",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "Top."
    },
    {
      "author_name": "Brayan David Gaona Amador",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "Excelente experiencia en un lugar muy bien ubicado en la ciudad, equipado con todo lo necesario para estancias largas, todo en perfecto estado."
    },
    {
      "author_name": "Angelica van der Drift",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "We had a good experience in this apartment. It is within walking distance of the center. The mattresses were on the hard side and you can hear everything that happens in the apartment. Also outside you could hear a lot of noise. The apartment is on the ground floor but with a small staircase with a stroller is doable. They also have a camping bed and a high chair. Gaurav was ready to answer all our questions and made it a lovely weekend."
    },
    {
      "author_name": "Veronica Martins",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Lugar bem arrumado, limpeza muito boa. Porem com muito barulho sem poder descansar direito. Mais ambiente super agradavel. Tirando a experiencia de barulho do andar de cima que foi terrivel e nao conseguimos descansar o lugar e maravilhoso."
    },
    {
      "author_name": "Pla",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "Sitio muy limpio y bonito. Bien situado con respecto a la estacion de tren, unos 15 o 20 minutos a pie. Barrio judio creo porque habia muchos. Tranquilo."
    },
    {
      "author_name": "Martin Rauscher",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "Furchtbar Betten, ansonsten ganz gut."
    },
    {
      "author_name": "s.mostawa",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "Place is comfortable and clean."
    },
    {
      "author_name": "Marina Rus",
      "rating": 5,
      "relative_time_description": "7 months ago",
      "text": "Rooms: 5. Service: 5. Location: 5."
    },
    {
      "author_name": "Doh C",
      "rating": 5,
      "relative_time_description": "7 months ago",
      "text": "Trip type: Vacation. Travel group: Solo. Rooms: 5. Service: 5. Location: 5. Hotel highlights: Luxury, Great view, Great value."
    },
    {
      "author_name": "Liliya Boiko",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": ""
    },
    {
      "author_name": "Jochen Grondelaers",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": ""
    }
  ]
}
